# GetBendData Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Rebar..::..GetBendData Method
Rebar Class See Also
---
Gets the RebarBendData, containing bar and hook information, of the instance.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2009
# Syntax
C#
---
```text
public RebarBendData GetBendData()
```

Visual Basic
---
```text
Public Function GetBendData As RebarBendData
```

Visual C++
---
```text
public:
RebarBendData^ GetBendData()
```

# Remarks
Internally, the bend data is used by many RebarShape methods to generate shape geometry.
# See Also
Rebar Class
Autodesk.Revit.DB.Structure Namespace